static/presentations/2020-08-26/index.org
#+TITLE: Summer Updates & Annual Goals
#+REVEAL_THEME: white
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: reveal_title_slide:nil
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
#+REVEAL_HLEVEL: 2
* Summer Updates
** Starship
- Special Ganymede queue
** SciPy
- [[https://www.youtube.com/watch?v=az1AHQMHiHA&list=PLYx7XA2nY5GdNCo46AUhZ8RwlshVmgZTa][Biology & Bioinformatics Playlist]]
** Improved Docs
- [[https://personal.utdallas.edu/~eam150030/fg/docs/][Link]]
- Password protected
- Hosted on UTD's personal pages
- [[https://github.com/Functional-Genomics-Lab/docs][Password and Username in README]]
** Nextflow Training Workshop
- [[https://www.youtube.com/watch?v=8_i8Tn335X0][Nextflow Training Workshop - July 2020 - Day 1 - YouTube]]
** GPU Servers
** RustConf
- [[https://www.youtube.com/watch?v=2b8InauuRqw&list=PL85XCvVPmGQijqvMcMBfYAwExx1eBu1Ei&index=4][Under a Microscope: Exploring Fast and Safe Rust for Biology by Samuel Lim]]
* Annual Goals
** #1 Removing Technical Debt
*** Creating a Personal knowledge base
**** Zettelkasten
**** Niklas Luhmann
**** [[https://takesmartnotes.com/][How to Take Smart Notes]]
**** [[https://zettelkasten.de/][zettelkasten.de]]
*** Courses
*** Re-Read Papers
*** Example
*** Some options
- https://roamresearch.com/ - Original App
- https://www.zettlr.com/ - Native App
- https://foambubble.github.io/foam/ - VS Code Extension
- https://logseq.com/ - Browser Based
*** Journaling vs Lab Notebook
** #2 Writing More
*** Creating a knowledge base
*** [[https://manubot.org/][Manubot]]
** #3 Being Deliberate
- Planning
- Learning too much
- Avoiding Perfectionism
* Projects for Semester
** eRNA GRO-Seq Nextflow Rewrite
** Mass Sample Transcript Miner
- SRA download/Raw Sample
- fastqc
- bowtie2/STAR
- bedtools intersect for genome location
- Result: samples that have transcripts in that location
