static/presentations/2020-08-26/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Summer Updates &amp; Annual Goals</title>
<meta name="author" content="Edmund Miller"/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/css/theme/white.css" id="theme"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section>
<section id="slide-org2225559">
<h2 id="org2225559">Summer Updates</h2>
<div class="outline-text-2" id="text-org2225559">
</div>
</section>
</section>
<section>
<section id="slide-org192539d">
<h3 id="org192539d">Starship</h3>
<ul>
<li>Special Ganymede queue</li>

</ul>
</section>
</section>
<section>
<section id="slide-org0199915">
<h3 id="org0199915">SciPy</h3>
<ul>
<li><a href="https://www.youtube.com/watch?v=az1AHQMHiHA&amp;list=PLYx7XA2nY5GdNCo46AUhZ8RwlshVmgZTa">Biology &amp; Bioinformatics Playlist</a></li>

</ul>
</section>
</section>
<section>
<section id="slide-org0d5a496">
<h3 id="org0d5a496">Improved Docs</h3>
<ul>
<li><a href="https://personal.utdallas.edu/~eam150030/fg/docs/">Link</a></li>
<li>Password protected</li>
<li>Hosted on UTD&rsquo;s personal pages</li>
<li><a href="https://github.com/Functional-Genomics-Lab/docs">Password and Username in README</a></li>

</ul>
</section>
</section>
<section>
<section id="slide-org54e6d43">
<h3 id="org54e6d43">Nextflow Training Workshop</h3>
<ul>
<li><a href="https://www.youtube.com/watch?v=8_i8Tn335X0">Nextflow Training Workshop - July 2020 - Day 1 - YouTube</a></li>

</ul>
</section>
</section>
<section>
<section id="slide-org0b41d75">
<h3 id="org0b41d75">GPU Servers</h3>
</section>
</section>
<section>
<section id="slide-org920805d">
<h3 id="org920805d">RustConf</h3>
<ul>
<li><a href="https://www.youtube.com/watch?v=2b8InauuRqw&amp;list=PL85XCvVPmGQijqvMcMBfYAwExx1eBu1Ei&amp;index=4">Under a Microscope: Exploring Fast and Safe Rust for Biology by Samuel Lim</a></li>

</ul>
</section>
</section>
<section>
<section id="slide-org29b6cd2">
<h2 id="org29b6cd2">Annual Goals</h2>
<div class="outline-text-2" id="text-org29b6cd2">
</div>
</section>
</section>
<section>
<section id="slide-org39f80b0">
<h3 id="org39f80b0">#1 Removing Technical Debt</h3>
<div class="outline-text-3" id="text-org39f80b0">
</div>
</section>
<section id="slide-org411bebc">
<h4 id="org411bebc">Creating a Personal knowledge base</h4>
<div class="outline-text-4" id="text-org411bebc">
</div>
<ul class="org-ul">
<li><a id="org883b06c"></a>Zettelkasten<br /></li>
<li><a id="org0082ea4"></a>Niklas Luhmann<br /></li>
<li><a id="org24c9055"></a><a href="https://takesmartnotes.com/">How to Take Smart Notes</a><br /></li>
<li><a id="orga49ba30"></a><a href="https://zettelkasten.de/">zettelkasten.de</a><br /></li>
</ul>
</section>
<section id="slide-org74cb6bd">
<h4 id="org74cb6bd">Courses</h4>
</section>
<section id="slide-org100ca93">
<h4 id="org100ca93">Re-Read Papers</h4>
</section>
<section id="slide-orgdddb699">
<h4 id="orgdddb699">Example</h4>
</section>
<section id="slide-org64520e7">
<h4 id="org64520e7">Some options</h4>
<ul>
<li><a href="https://roamresearch.com/">https://roamresearch.com/</a> - Original App</li>
<li><a href="https://www.zettlr.com/">https://www.zettlr.com/</a> - Native App</li>
<li><a href="https://foambubble.github.io/foam/">https://foambubble.github.io/foam/</a> - VS Code Extension</li>
<li><a href="https://logseq.com/">https://logseq.com/</a> - Browser Based</li>

</ul>
</section>
<section id="slide-org18aa016">
<h4 id="org18aa016">Journaling vs Lab Notebook</h4>
</section>
</section>
<section>
<section id="slide-org275d147">
<h3 id="org275d147">#2 Writing More</h3>
<div class="outline-text-3" id="text-org275d147">
</div>
</section>
<section id="slide-org7d15ce9">
<h4 id="org7d15ce9">Creating a knowledge base</h4>
</section>
<section id="slide-org57d20f8">
<h4 id="org57d20f8"><a href="https://manubot.org/">Manubot</a></h4>
</section>
</section>
<section>
<section id="slide-orgba087df">
<h3 id="orgba087df">#3 Being Deliberate</h3>
<ul>
<li>Planning</li>
<li>Learning too much</li>
<li>Avoiding Perfectionism</li>

</ul>
</section>
</section>
<section>
<section id="slide-org1624c7f">
<h2 id="org1624c7f">Projects for Semester</h2>
<div class="outline-text-2" id="text-org1624c7f">
</div>
</section>
</section>
<section>
<section id="slide-org753cc9b">
<h3 id="org753cc9b">eRNA GRO-Seq Nextflow Rewrite</h3>
</section>
</section>
<section>
<section id="slide-orgc74b12d">
<h3 id="orgc74b12d">Mass Sample Transcript Miner</h3>
<ul>
<li>SRA download/Raw Sample</li>
<li>fastqc</li>
<li>bowtie2/STAR</li>
<li>bedtools intersect for genome location</li>
<li>Result: samples that have transcripts in that location</li>

</ul>
</section>
</section>
</div>
</div>
<script src="https://cdn.jsdelivr.net/npm/reveal.js/js/reveal.js"></script>
<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
mouseWheel: false,
fragmentInURL: false,
hashOneBasedIndex: false,
pdfSeparateFragments: true,

overview: true,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'convex', // see README of reveal.js for options
transitionSpeed: 'default',

// Optional libraries used to extend reveal.js
dependencies: [
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/search/search.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } }]

});
</script>
</body>
</html>
